init.org

* Installation of this ORG file

  *First time*
  Because of some of this elisp makes sure that emacs checks TLS certificates,
  We must first execute/install:
  1. python -m pip install --user certifi
  2. apt-get install gnutls-bin

  Then do =M-x org-babel-load-file= and provide =~/.emacs.d/init.org=. This will
  evaluate every piece of emacs-lisp code available here.

  *Following times*
  Simply reload changes with =C-c i=.

** Guide new users on track

   Ok, nothing to see here. This message is just for lost soules looking in the
   =init.el= file instead of here, in the org-file.

#+BEGIN_SRC emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;  NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   ;;
  ;;                                                                          ;;
  ;;                 You are looking in the wrong file...                     ;;
  ;;          Go to the init.org file instead, where you will find            ;;
  ;;               an explanation to all parameters as well.                  ;;
  ;;                                                                          ;;
  ;;                             Good luck!                                   ;;
  ;;                                                                          ;;
  ;;  NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC

* Requirements

  This init-file assumes *Emacs 25* but will probably work with Emacs 24.

#+BEGIN_SRC emacs-lisp
  (let ((minver 24)
        (recver 25))
    (if (< emacs-major-version minver)
        (error "Your Emacs is too old -- this config requires v%s or higher"
               minver)
      (when (< emacs-major-version recver)
        (format-message
         (concat "You are probably fine with Emacs v%s for this init-file, but "
                 "I cannot guarantee it. Recommended version of Emacs is v%s")
         minver recver))))
#+END_SRC

  It also assumes Unix, but could probably be run on other OSes.

#+BEGIN_SRC emacs-lisp
  (let ((recos "gnu/linux"))
    (when (not (string-equal system-type recos))
      (format-message
       (concat "You might be fine with %s as OS for this init-file, but I "
               "cannot guarantee it. Recommended OS is %s")
       system-type recos)))
#+END_SRC

* Preinit stuff

  Here we place thing we would like to load first, for example benchmarking.

** Garbage collect

   Garbage collection is default after 800kB, lets raise it some.
   This might speedup Emacs but will cost in memory consumtion.

#+BEGIN_SRC emacs-lisp
  (setq-default gc-cons-threshold 10000000) ;; 10mB
#+END_SRC

** Load paths

   So I have a directory ~.emacs.d/other/~ from where I want to load
   custom elisp files.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "other" user-emacs-directory))
#+END_SRC

** Benchmarking

   This will measure how fast/slow different elisp files are to load.
   When Emacs have started, do =C-h v sanityinc/require-times=
   Thank you Steve Purcell!

#+BEGIN_SRC emacs-lisp
  (defun sanityinc/time-subtract-millis (b a)
    (* 1000.0 (float-time (time-subtract b a))))

  (defvar sanityinc/require-times nil
    "A list of (FEATURE . LOAD-DURATION).
  LOAD-DURATION is the time taken in milliseconds to load FEATURE.")

  (defadvice require
    (around build-require-times (feature &optional filename noerror) activate)
    "Note in `sanityinc/require-times' the time taken to require each feature."
    (let* ((already-loaded (memq feature features))
           (require-start-time (and (not already-loaded) (current-time))))
      (prog1
          ad-do-it
        (when (and (not already-loaded) (memq feature features))
          (add-to-list 'sanityinc/require-times
                       (cons feature
                             (sanityinc/time-subtract-millis (current-time)
                                                             require-start-time))
                       t)))))
#+END_SRC

* Packages

  First of all, let us add some security.

  This is taken from the blog post:
  "Your Text Editor Is Malware" on <2015-11-12 Thu>
  https://glyph.twistedmatrix.com/2015/11/editor-malware.html

  Two things are needed for this to work.
  1. python -m pip install --user certifi
  2. apt-get install gnutls-bin

  Debug level; 0 minimum
#+BEGIN_SRC emacs-lisp
  (setq gnutls-log-level 0)
#+END_SRC

  Check if a certificate can be trusted
#+BEGIN_SRC emacs-lisp
  (setq tls-checktrust 'ask)
#+END_SRC

  Set the trustfile and which program to use.
#+BEGIN_SRC emacs-lisp
  (let ((trustfile
         (replace-regexp-in-string
          "\\\\" "/"
          (replace-regexp-in-string
           "\n" ""
           (shell-command-to-string "python -m certifi")))))
    ;; (setq tls-program
    ;;       (list
    ;;        (format "gnutls-cli%s --x509cafile %s -p %%p %%h"
    ;;                (if (eq window-system 'w32) ".exe" "") trustfile)))
    (setq gnutls-verify-error nil)
    (setq gnutls-trustfiles (list trustfile))
    (add-to-list 'gnutls-trustfiles "/etc/ssl/certs/ca-certificates.crt")
    (add-to-list 'gnutls-trustfiles "/etc/pki/tls/certs/ca-bundle.crt")
    (add-to-list 'gnutls-trustfiles "/etc/ssl/ca-bundle.pem")
    (add-to-list 'gnutls-trustfiles "/usr/ssl/certs/ca-bundle.crt")
    (add-to-list 'gnutls-trustfiles "/usr/local/share/certs/ca-root-nss.crt"))
#+END_SRC

  This can be evaluated against the following snippet. If you evaluate it and
  you get an error, your trust roots aren’t set up right and you can’t connect
  to a valid site.

#+BEGIN_SRC emacs-lisp :tangle no
  (if (condition-case e
          (progn
            (url-retrieve "https://wrong-host.badssl.com/"
                          (lambda (retrieved) t))
            (url-retrieve "https://self-signed.badssl.com/"
                          (lambda (retrieved) t))
            t)
        ('error nil))
      (error "tls misconfigured")
    (url-retrieve "https://badssl.com"
                  (lambda (retrieved) t)))
#+END_SRC

  I want my packages to install into the =~/.emacs.d/elpa/= directory.

#+BEGIN_SRC emacs-lisp
  (defconst elpa-dir "elpa"
    "Which directory elpa packages is installed in. Defined in package.el.")
#+END_SRC

  Initiate packages

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-archives
        '(
          ("gnu"       . "https://elpa.gnu.org/packages/")
          ("melpa"     . "https://melpa.org/packages/")
          ("marmalade" . "https://marmalade-repo.org/packages/")
          ("elpy"      . "https://jorgenschaefer.github.io/packages/")
          ))

  (unless (file-exists-p  (concat user-emacs-directory elpa-dir))
    (message "No packages exists yet, refreshing archives.")
    (package-refresh-contents))

  (package-initialize)
#+END_SRC

  We also define a function for automatic installation of packages, to be used
  on demand.

#+BEGIN_SRC emacs-lisp
  (defun ensure-pkg (&rest pkgs)
    "If package PKG is not installed, install it."
    (dolist (pkg pkgs)
      (unless (package-installed-p pkg)
        (progn
          (unless (assoc pkg package-archive-contents)
            (package-refresh-contents))
          (package-install pkg)))))
#+END_SRC

* Speedup and general annoyance

** Bi-directional text

   Bidi should never be turned off, the emacs display system is, apparently,
   too dependent on it. However, telling it to always print text =left-to-right=
   should speed things up if you never have any bi-directional text to view.

#+BEGIN_SRC emacs-lisp
  (setq-default bidi-paragraph-direction 'left-to-right)
#+END_SRC

** Scratch buffer

   Clear the comments from the Scratch-buffer.

#+BEGIN_SRC emacs-lisp
  (setq initial-scratch-message nil)
#+END_SRC

** Open the .emacs-file

   Open this file when ~C-c e~ is pressed.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c e") 'open-dot-emacs)
  (defun open-dot-emacs ()
    (interactive)
    (let ((user-init-file-org (concat (file-name-directory user-init-file)
                                      (file-name-base user-init-file)
                                      ".org")))
      (if (file-exists-p user-init-file-org)
          (find-file user-init-file-org)
        (find-file user-init-file))))
#+END_SRC

** Easier other-window
  Instead of doing ~C-x o~ every time I want to switch window, I can just do
  ~C-<tab>~. Also, on ~C-S-<tab>~ I go backwards instead.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-<tab>") 'other-window)
  (global-set-key (kbd "<C-S-iso-lefttab>") 'select-previous-window)
  (defun select-previous-window ()
    (interactive)
    (select-window (previous-window)))
#+END_SRC

** Fullscreen

  Fullscreen on ~<F11>~

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<f11>") 'fullscreen)
  (defun fullscreen ()
    (interactive)
    (set-frame-parameter nil 'fullscreen
                         (if (frame-parameter nil 'fullscreen) nil 'fullboth)))
#+END_SRC

** Whitespace
*** Remove tabs

    Call this function to replace all tabs in the current buffer with spaces.

#+BEGIN_SRC emacs-lisp
  (defun untabify-buffer ()
    "Untabify current buffer."
    (interactive)
    (save-excursion (untabify (point-min) (point-max))))
#+END_SRC

*** Spaces over tabs

    Also, I prefer spaces to tabs.

#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
#+END_SRC

