init.el
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   ;;
;;                                                                          ;;
;;                 You are looking in the wrong file...                     ;;
;;          Go to the init.org file instead, where you will find            ;;
;;               an explanation to all parameters as well.                  ;;
;;                                                                          ;;
;;                             Good luck!                                   ;;
;;                                                                          ;;
;;  NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(let ((minver 24)
      (recver 25))
  (if (< emacs-major-version minver)
      (error "Your Emacs is too old -- this config requires v%s or higher"
             minver)
    (when (< emacs-major-version recver)
      (format-message
       (concat "You are probably fine with Emacs v%s for this init-file, but "
               "I cannot guarantee it. Recommended version of Emacs is v%s")
       minver recver))))

(let ((recos "gnu/linux"))
  (when (not (string-equal system-type recos))
    (format-message
     (concat "You might be fine with %s as OS for this init-file, but I "
             "cannot guarantee it. Recommended OS is %s")
     system-type recos)))

(setq-default gc-cons-threshold 10000000) ;; 10mB

(add-to-list 'load-path (expand-file-name "other" user-emacs-directory))

(defun sanityinc/time-subtract-millis (b a)
  (* 1000.0 (float-time (time-subtract b a))))

(defvar sanityinc/require-times nil
  "A list of (FEATURE . LOAD-DURATION).
LOAD-DURATION is the time taken in milliseconds to load FEATURE.")

(defadvice require
  (around build-require-times (feature &optional filename noerror) activate)
  "Note in `sanityinc/require-times' the time taken to require each feature."
  (let* ((already-loaded (memq feature features))
         (require-start-time (and (not already-loaded) (current-time))))
    (prog1
        ad-do-it
      (when (and (not already-loaded) (memq feature features))
        (add-to-list 'sanityinc/require-times
                     (cons feature
                           (sanityinc/time-subtract-millis (current-time)
                                                           require-start-time))
                     t)))))

(setq gnutls-log-level 0)

(setq tls-checktrust 'ask)

(let ((trustfile
       (replace-regexp-in-string
        "\\\\" "/"
        (replace-regexp-in-string
         "\n" ""
         (shell-command-to-string "python -m certifi")))))
  ;; (setq tls-program
  ;;       (list
  ;;        (format "gnutls-cli%s --x509cafile %s -p %%p %%h"
  ;;                (if (eq window-system 'w32) ".exe" "") trustfile)))
  (setq gnutls-verify-error nil)
  (setq gnutls-trustfiles (list trustfile))
  (add-to-list 'gnutls-trustfiles "/etc/ssl/certs/ca-certificates.crt")
  (add-to-list 'gnutls-trustfiles "/etc/pki/tls/certs/ca-bundle.crt")
  (add-to-list 'gnutls-trustfiles "/etc/ssl/ca-bundle.pem")
  (add-to-list 'gnutls-trustfiles "/usr/ssl/certs/ca-bundle.crt")
  (add-to-list 'gnutls-trustfiles "/usr/local/share/certs/ca-root-nss.crt"))

(defconst elpa-dir "elpa"
  "Which directory elpa packages is installed in. Defined in package.el.")

(require 'package)
(setq package-archives
      '(
        ("gnu"       . "https://elpa.gnu.org/packages/")
        ("melpa"     . "https://melpa.org/packages/")
        ("marmalade" . "https://marmalade-repo.org/packages/")
        ("elpy"      . "https://jorgenschaefer.github.io/packages/")
        ))

(unless (file-exists-p  (concat user-emacs-directory elpa-dir))
  (message "No packages exists yet, refreshing archives.")
  (package-refresh-contents))

(package-initialize)

(defun ensure-pkg (&rest pkgs)
  "If package PKG is not installed, install it."
  (dolist (pkg pkgs)
    (unless (package-installed-p pkg)
      (progn
        (unless (assoc pkg package-archive-contents)
          (package-refresh-contents))
        (package-install pkg)))))

(setq-default bidi-paragraph-direction 'left-to-right)

(setq initial-scratch-message nil)

(global-set-key (kbd "C-c e") 'open-dot-emacs)
(defun open-dot-emacs ()
  (interactive)
  (let ((user-init-file-org (concat (file-name-directory user-init-file)
                                    (file-name-base user-init-file)
                                    ".org")))
    (if (file-exists-p user-init-file-org)
        (find-file user-init-file-org)
      (find-file user-init-file))))

(global-set-key (kbd "C-<tab>") 'other-window)
(global-set-key (kbd "<C-S-iso-lefttab>") 'select-previous-window)
(defun select-previous-window ()
  (interactive)
  (select-window (previous-window)))

(global-set-key (kbd "<f11>") 'fullscreen)
(defun fullscreen ()
  (interactive)
  (set-frame-parameter nil 'fullscreen
                       (if (frame-parameter nil 'fullscreen) nil 'fullboth)))

(defun untabify-buffer ()
  "Untabify current buffer."
  (interactive)
  (save-excursion (untabify (point-min) (point-max))))

(setq-default indent-tabs-mode nil)
