init.org
*** Show tabs and trailing whitespace

    Show some whitespaces I hate everywhere.

    Styles:
    |-------------------------+------------------------------------------------|
    | face                    | enable all visualization via faces instead of  |
    |                         | via a display table. This value must be set to |
    |                         | make any of the following group to work.       |
    |-------------------------+------------------------------------------------|
    | trailing                | trailing blanks                                |
    | tabs                    | TABs                                           |
    | spaces                  | SPACEs and HARD SPACEs                         |
    | lines                   | lines which have columns beyond                |
    |                         | ‘whitespace-line-column’. Whole line is        |
    |                         | highlighted.                                   |
    | lines-tail              | lines which have columns beyond                |
    |                         | ‘whitespace-line-column’.                      |
    | newline                 | NEWLINEs                                       |
    | empty                   | empty lines at beginning and/or end of buffer. |
    | indentation::tab        | 8 or more SPACEs at beginning of line.         |
    | indentation::space      | TABs at beginning of line.                     |
    | indentation             | 8 or more SPACEs at beginning of line, if      |
    |                         | ‘indent-tabs-mode’ is non-nil; otherwise, TABs |
    |                         | at beginning of line.                          |
    | big-indent              | Big indentations                               |
    | space-after-tab::tab    | 8 or more SPACEs after a TAB.                  |
    | space-after-tab::space  | TABs are visualized when 8 or more SPACEs      |
    |                         | occur after a TAB.                             |
    | space-after-tab         | 8 or more SPACEs after a TAB are visualized,   |
    |                         | if ‘indent-tabs-mode’ is non-nil; otherwise,   |
    |                         | the TABs.                                      |
    | space-before-tab::tab   | SPACEs before TAB                              |
    | space-before-tab::space | TABs when SPACEs occur before TAB.             |
    | space-before-tab        | SPACEs before TAB are visualized, if           |
    |                         | ‘indent-tabs-mode’ is non-nil; otherwise, the  |
    |                         | TABs.                                          |
    |-------------------------+------------------------------------------------|
    | space-mark              | SPACEs and HARD SPACEs                         |
    | tab-mark                | TABs                                           |
    | newline-mark            | NEWLINEs                                       |
    |-------------------------+------------------------------------------------|

#+BEGIN_SRC emacs-lisp
  (setq whitespace-style '(face trailing tabs lines-tail))
  (global-whitespace-mode 1)
#+END_SRC

** Remove suspend

   Minimizing Emacs when ~C-z~ is pressed is a real annoyance if you are drunk
   typing.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-z") 'eof)
#+END_SRC

** Unset mouse

   On my laptop I have a touchpad which arbitrarily clicks when I am typing.

#+BEGIN_SRC emacs-lisp
(defun global-unset-mouse ()
  "Unset all mouse events"
  (interactive)
  (dolist (k '([mouse-1] [down-mouse-1] [drag-mouse-1]
               [double-mouse-1] [triple-mouse-1]
               [mouse-2] [down-mouse-2] [drag-mouse-2]
               [double-mouse-2] [triple-mouse-2]
               [mouse-3] [down-mouse-3] [drag-mouse-3]
               [double-mouse-3] [triple-mouse-3]
               [mouse-4] [down-mouse-4] [drag-mouse-4]
               [double-mouse-4] [triple-mouse-4]
               [mouse-5] [down-mouse-5] [drag-mouse-5]
               [double-mouse-5] [triple-mouse-5]
               [C-mouse-5] [S-mouse-5] [C-mouse-4] [S-mouse-4]
               [C-down-mouse-1] [C-down-mouse-3]))
   (global-unset-key k)))
#+END_SRC

** Create directories

   Create the given directories if I specify a path that does not exist.

#+BEGIN_SRC emacs-lisp
(defun create-non-existent-directory ()
  "If The parent directory does not exist, this function will ask to create it."
  (let ((parent-directory (file-name-directory buffer-file-name))
        (q "Directory `%s' does not exist! Create it?"))
    (when (and (not (file-exists-p parent-directory))
               (y-or-n-p
                (format q parent-directory)))
      (make-directory parent-directory t))))
#+END_SRC

** Winner mode

   Winner mode is a global minor mode that records the changes in the window
   configuration (i.e. how the frames are partitioned into windows) so that the
   changes can be "undone" using the command ‘winner-undo’.  By default this one
   is bound to the key sequence ‘C-c <left>’.  If you change your mind (while
   undoing), you can press ‘C-c <right>’ (calling ‘winner-redo’).

#+BEGIN_SRC emacs-lisp
  (winner-mode 1)
#+END_SRC

** Toolbars and menues

   Remove the scrollbars, toolbars and menues. Who needs them anyways?

#+BEGIN_SRC emacs-lisp
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
#+END_SRC

** Uniquify

   Really cool feature.

   Emacs's traditional method for making buffer names unique adds <2>, <3>,
   etc. to the end of (all but one of) the buffers.  This file replaces that
   behavior, for buffers visiting files and dired buffers, with a uniquification
   that adds parts of the file name until the buffer names are unique.

#+BEGIN_SRC emacs-lisp
  (require 'uniquify)
#+END_SRC

    How to construct unique buffer names for files with the same base name.  The
    value can be one of: ‘forward’, ‘reverse’, ‘post-forward’,
    ‘post-forward-angle-brackets’, or nil.

    For example, the files =/foo/bar/mumble/name= and =/baz/quux/mumble/name=
    would have the following buffer names in the various styles:

    forward                       bar/mumble/name    quux/mumble/name
    reverse                       name\mumble\bar    name\mumble\quux
    post-forward                  name|bar/mumble    name|quux/mumble
    post-forward-angle-brackets   name<bar/mumble>   name<quux/mumble>
    nil                           name               name<2>

    The "mumble" part may be stripped as well, depending on the setting of
    `uniquify-strip-common-suffix'.

#+BEGIN_SRC emacs-lisp
  (setq uniquify-buffer-name-style 'post-forward
        uniquify-strip-common-suffix t)
#+END_SRC

** Misc

   Instead of having to type "yes<Enter>" or "no<Enter>" when prompted, just
   pressing "y" or "n" should be enough.

#+BEGIN_SRC emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

   Also show which character the point is on next to the line-number.

#+BEGIN_SRC emacs-lisp
  (column-number-mode 1)
#+END_SRC

** Backup

   Backup unsaved files.

   This should be quite self-explanatory.

#+BEGIN_SRC emacs-lisp
  (setq
     backup-by-copying t             ; don't clobber symlinks
     backup-directory-alist
      '(("." . "~/.emacs.d/.saves")) ; don't litter my fs tree
     delete-old-versions t
     kept-new-versions 6
     kept-old-versions 2
     version-control t)              ; use versioned backups
#+END_SRC

** Printer

   Setting up the LPR (line printer). You can find your printer name
   by `lpstat -d -p' in a shell.

#+BEGIN_SRC
  (setq printer-name "Pull_Print_Unix")
#+END_SRC

* Magit

  Magit is in my opinion invalueable. It is the best git-manager there is!

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'magit)
  (require 'magit)
#+END_SRC

  I like to change windows with C-<tab>

#+BEGIN_SRC emacs-lisp
  (define-key magit-mode-map (kbd "C-<tab>") 'other-window)
#+END_SRC

  Open magit-status in anywhere I am.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c q") 'magit-status)
#+END_SRC

* Org

  Org-mode is a mode for keeping notes, maintaining ToDo lists, and
  doing project planning with a fast and effective plain-text system.

  Org is one of the most powerful modes in Emacs. It is used for
  organizing and keeping track of activities, notes, dates, and for
  writing papers etc. It can also export your notes to pdf, html,
  ascii etc. It is super cool and in my opinion
  invaluable!  [fn:organize-your-life-in-plain-text]

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'org)
  (require 'org)
#+END_SRC

  There are three top keys that should always work whereever you are.
  Store a link to a file, capture a new task, and open the org-agenda.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c a") 'org-agenda)
#+END_SRC

  Where to keep Org agenda files. This is a list of all places where
  Org should look for files.

#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files (list "~/ORG/"))
#+END_SRC

  Monday is the first day of the week

#+BEGIN_SRC emacs-lisp
  (setq calendar-week-start-day 1)
#+END_SRC

  C-a and C-e will ignore some stuff on first attempt

  Non-nil means ‘C-a’ and ‘C-e’ behave specially in headlines and
  items.

  When t, ‘C-a’ will bring back the cursor to the beginning of the
  headline text, i.e. after the stars and after a possible TODO
  keyword.  In an item, this will be the position after bullet and
  check-box, if any.  When the cursor is already at that position,
  another ‘C-a’ will bring it to the beginning of the line.

  ‘C-e’ will jump to the end of the headline, ignoring the presence of
  tags in the headline.  A second ‘C-e’ will then jump to the true end
  of the line, after any tags.  This also means that, when this
  variable is non-nil, ‘C-e’ also will never jump beyond the end of
  the heading of a folded section, i.e. not after the ellipses.

  When set to the symbol ‘reversed’, the first ‘C-a’ or ‘C-e’ works
  normally, going to the true line boundary first.  Only a directly
  following, identical keypress will bring the cursor to the special
  positions.

  This may also be a cons cell where the behavior for ‘C-a’ and ‘C-e’
  is set separately.

#+BEGIN_SRC emacs-lisp
  (setq org-special-ctrl-a/e t)
#+END_SRC

  Adapt indentation to the outline node level.  When this variable is
  set, Org assumes that you write outlines by indenting text in each
  node to align with the headline (after the stars).

#+BEGIN_SRC emacs-lisp
  (setq org-adapt-indentation t)
#+END_SRC

  TeX-like sub and superscripts with X^{some} and Y_{thing}

#+BEGIN_SRC emacs-lisp
  (setq org-use-sub-superscripts '{})
#+END_SRC

  I really like to change windows with C-<tab>

#+BEGIN_SRC emacs-lisp
  (define-key org-mode-map (kbd "C-<tab>") 'other-window)
#+END_SRC

* Eshell

  Eshell is a command shell written in Emacs Lisp. Everything it does,
  it uses Emacs’s facilities to do. This means that Eshell is as
  portable as Emacs itself. It also means that cooperation with Lisp
  code is natural and seamless.

  Unlike the other shells in Emacs, Eshell does not inherit from
  comint-mode. This means that hooks and routines written for
  comint-mode won’t work with Eshell.

  For more information check:
  https://www.masteringemacs.org/article/complete-guide-mastering-eshell


  Require eshell is not really needed, but stuff like
  `eshell-visual-commands' does not exist until it is loaded.

#+BEGIN_SRC emacs-lisp
  ;(require 'eshell)
#+END_SRC

** Aliases

  Alias emacs commands to find-file, so it opens as buffers instead of
  new emacses.

#+BEGIN_SRC emacs-lisp
  (defalias 'ec 'find-file)
  (defalias 'emacs 'find-file)
#+END_SRC

** Visual commands

   Some commands are too complex to be displayed by Eshell directly,
   and require special handling. An example would be `top', a program
   that won’t work with a dumb terminal. To support these commands
   Eshell will run a `term' session when you invoke a command Eshell
   considers visual.

#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'em-term
      (add-to-list 'eshell-visual-commands "ssh")
      (add-to-list 'eshell-visual-commands "htop")
      (add-to-list 'eshell-visual-commands "tail"))
#+END_SRC

** Completion

   If non-nil, hitting the TAB key cycles through the completion list.
   Typical Emacs behavior is to complete as much as possible, then
   pause waiting for further input.  Then if TAB is hit again, show a
   list of possible completions.  When `pcomplete-cycle-completions'
   is non-nil, it acts more like zsh or 4nt, showing the first maximal
   match first, followed by any further matches on each subsequent
   pressing of the TAB key.

#+BEGIN_SRC emacs-lisp
  (setq eshell-cmpl-cycle-completions nil)
#+END_SRC

* Work stuff

  This chapter will handle configuration and packages I need for work.

** Tramp

   Fix so Tramp connects correctly.

#+BEGIN_SRC emacs-lisp
  (setq shell-prompt-pattern "^.*eselnts1349[^>]* *")
#+END_SRC

