init.el

(setq whitespace-style '(face trailing tabs lines-tail))
(global-whitespace-mode 1)

(global-set-key (kbd "C-z") 'eof)

(defun global-unset-mouse ()
  "Unset all mouse events"
  (interactive)
  (dolist (k '([mouse-1] [down-mouse-1] [drag-mouse-1]
               [double-mouse-1] [triple-mouse-1]
               [mouse-2] [down-mouse-2] [drag-mouse-2]
               [double-mouse-2] [triple-mouse-2]
               [mouse-3] [down-mouse-3] [drag-mouse-3]
               [double-mouse-3] [triple-mouse-3]
               [mouse-4] [down-mouse-4] [drag-mouse-4]
               [double-mouse-4] [triple-mouse-4]
               [mouse-5] [down-mouse-5] [drag-mouse-5]
               [double-mouse-5] [triple-mouse-5]
               [C-mouse-5] [S-mouse-5] [C-mouse-4] [S-mouse-4]
               [C-down-mouse-1] [C-down-mouse-3]))
   (global-unset-key k)))

(defun create-non-existent-directory ()
  "If The parent directory does not exist, this function will ask to create it."
  (let ((parent-directory (file-name-directory buffer-file-name))
        (q "Directory `%s' does not exist! Create it?"))
    (when (and (not (file-exists-p parent-directory))
               (y-or-n-p
                (format q parent-directory)))
      (make-directory parent-directory t))))

(winner-mode 1)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)

(require 'uniquify)

(setq uniquify-buffer-name-style 'post-forward
      uniquify-strip-common-suffix t)

(fset 'yes-or-no-p 'y-or-n-p)

(column-number-mode 1)

(setq
   backup-by-copying t             ; don't clobber symlinks
   backup-directory-alist
    '(("." . "~/.emacs.d/.saves")) ; don't litter my fs tree
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t)              ; use versioned backups

(setq system-time-locale "C")

(ensure-pkg 'magit)
(require 'magit)

(define-key magit-mode-map (kbd "C-<tab>") 'other-window)

(global-set-key (kbd "C-c q") 'magit-status)

(ensure-pkg 'org)
(require 'org)

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)

(setq org-agenda-files (list "~/ORG/"))

(setq calendar-week-start-day 1)

(setq org-special-ctrl-a/e t)

(setq org-adapt-indentation t)

(setq org-use-sub-superscripts '{})

(define-key org-mode-map (kbd "C-<tab>") 'other-window)

;(require 'eshell)

(defalias 'ec 'find-file)
(defalias 'emacs 'find-file)

(with-eval-after-load 'em-term
    (add-to-list 'eshell-visual-commands "ssh")
    (add-to-list 'eshell-visual-commands "htop")
    (add-to-list 'eshell-visual-commands "tail"))

(setq eshell-cmpl-cycle-completions nil)

(setq shell-prompt-pattern "^.*eselnts1349[^>]* *")
