init.org
** Clearcase

   Sometimes I wonder if we are the only one using clearcase. If someone out
   there still use it, you can do it like this.

   Wrap it in a function and you do not need to automatically initiate it. Just
   manually call ~clearcase-mode-on~ when needed.

#+BEGIN_SRC emacs-lisp
  (defun clearcase-mode-on ()
    (interactive)
    (setq directory-sep-char ?/
          ;clearcase-checkin-arguments (quote ("-nc"))
          ;clearcase-checkout-arguments (quote ("-nc"))
          )
    (require 'clearcase))
#+END_SRC

** BT erl

   BT erl is a common-test framework for Erlang. Load it if it exist.

   Remember to set the environment variable `BT_ERL_PATH'.

#+BEGIN_SRC emacs-lisp
  (let ((bt-erl-path (getenv "BT_ERL_PATH")))
    (when (and bt-erl-path (file-exists-p bt-erl-path))
      (add-to-list 'load-path bt-erl-path)
      (require 'emacs_bt)))
#+END_SRC

* Programming

** Erlang

   The best programming language there is!

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'erlang)
  (require 'erlang-start)
#+END_SRC

  Erlang root directory.  The directory where the Erlang system is
  installed.  The name should not contain the trailing slash.

#+BEGIN_SRC emacs-lisp
  (setq erlang-root-dir "/opt/erlang/19.0")
#+END_SRC

*** EDTS

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'edts)
  (require 'edts-start)
#+END_SRC

  Start EDTS when Erlang starts.

#+BEGIN_SRC emacs-lisp
  ; (add-hook 'erlang-mode-hook '(lambda () (require 'edts-start)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq edts-man-root "/opt/erlang/19.0/lib/erlang")
#+END_SRC

** Elisp

   The second best programming language there is! :)

#+BEGIN_SRC emacs-lisp
#+END_SRC

** (Node-)JS

   Use js-comint-mode

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'js-comint)
  (require 'js-comint)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq inferior-js-program-command "node")
#+END_SRC

   Start nodejs in background on C-c C-k

#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'js-mode
    (define-key js-mode-map (kbd "C-c C-k") 'seba/start-nodejs-in-background)
    (defun seba/start-nodejs-in-background ()
      (interactive)
      (message "Not Implemented Yet")))
#+END_SRC

** Scala

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'scala-mode)
#+END_SRC

* Misc major modes

** Helm

   Helm is an Emacs framework for incremental completions and
   narrowing selections. It helps to rapidly complete file names,
   buffer names, or any other Emacs interactions requiring selecting
   an item from a list of possible choices.

#+BEGIN_SRC emacs-lisp
  (ensure-pkg 'helm)
  (require 'helm-config)
#+END_SRC

   Start helm everywhere, as opposed to ~M-x helm-M-x~.

#+BEGIN_SRC emacs-lisp
  (helm-mode 1)
#+END_SRC

   Auto resize helm window when enabled.
   Helm window is re-sized according to ‘helm-autoresize-max-height’
   and ‘helm-autoresize-min-height’.

#+BEGIN_SRC emacs-lisp
  (helm-autoresize-mode t)
#+END_SRC

   I think it is confusing when helm forces all windows to "jump
   around". Maybe i need to look at
   http://emacs.stackexchange.com/a/15172

   Forces split inside selected window when non-‘nil’.

#+BEGIN_SRC emacs-lisp
  (setq helm-split-window-in-side-p t)
#+END_SRC

   Auto update when only one candidate directory is matched.  Default
   value when starting ‘helm-find-files’ is nil because it prevent
   using <backspace> to delete char backward and by the way confuse
   beginners.  For a better experience with ‘helm-find-files’ set this
   to non--nil and use C-<backspace> to toggle it.

#+BEGIN_SRC emacs-lisp
  (setq helm-ff-auto-update-initial-value nil)
#+END_SRC

   Enable fuzzy matching in ‘helm-mode’ every-where possible.

#+BEGIN_SRC emacs-lisp
  (setq helm-mode-fuzzy-match t)
  (setq helm-completion-in-region-fuzzy-match t)
  (setq helm-buffers-fuzzy-matching t)
  (setq helm-recentf-fuzzy-match t)
  (setq helm-locate-fuzzy-match t)
  (setq helm-M-x-fuzzy-match t)
  (setq helm-semantic-fuzzy-match t)
  (setq helm-imenu-fuzzy-match t)
  (setq helm-apropos-fuzzy-match t)
  (setq helm-lisp-fuzzy-completion t)
#+END_SRC

  Bind Helm keys

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b")    'helm-buffers-list)
  (global-set-key (kbd "M-x")        'helm-M-x)
  (global-set-key (kbd "C-c h")      'helm-command-prefix)
  (global-set-key (kbd "C-x C-f")    'helm-find-files)
  (global-set-key (kbd "M-y")        'helm-show-kill-ring)
  (global-set-key (kbd "M-s o")      'helm-occur)
  (global-set-key (kbd "C-h SPC")    'helm-all-mark-rings)
#+END_SRC

  Rebind tab to run persistent action.

#+BEGIN_SRC emacs-lisp
  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
#+END_SRC
