init.el

(defun clearcase-mode-on ()
  (interactive)
  (setq directory-sep-char ?/
        ;clearcase-checkin-arguments (quote ("-nc"))
        ;clearcase-checkout-arguments (quote ("-nc"))
        )
  (require 'clearcase))

(let ((bt-erl-path (getenv "BT_ERL_PATH")))
  (when (and bt-erl-path (file-exists-p bt-erl-path))
    (add-to-list 'load-path bt-erl-path)
    (require 'emacs_bt)))

(ensure-pkg 'erlang)
(require 'erlang-start)

(setq erlang-root-dir "/opt/erlang/19.1")

(add-to-list 'exec-path (concat erlang-root-dir "/bin"))

(ensure-pkg 'edts)
(require 'edts-start)

; (add-hook 'erlang-mode-hook '(lambda () (require 'edts-start)))

(setq edts-man-root "/opt/erlang/19.0/lib/erlang")



(ensure-pkg 'js-comint)
(require 'js-comint)

(setq inferior-js-program-command "node")

(with-eval-after-load 'js-mode
  (define-key js-mode-map (kbd "C-c C-k") 'seba/start-nodejs-in-background)
  (defun seba/start-nodejs-in-background ()
    (interactive)
    (message "Not Implemented Yet")))

(ensure-pkg 'scala-mode)

(ensure-pkg 'helm)
(require 'helm-config)

(helm-mode 1)

(helm-autoresize-mode t)

(setq helm-split-window-in-side-p t)

(setq helm-ff-auto-update-initial-value nil)

(setq helm-mode-fuzzy-match t)
(setq helm-completion-in-region-fuzzy-match t)
(setq helm-buffers-fuzzy-matching t)
(setq helm-recentf-fuzzy-match t)
(setq helm-locate-fuzzy-match t)
(setq helm-M-x-fuzzy-match t)
(setq helm-semantic-fuzzy-match t)
(setq helm-imenu-fuzzy-match t)
(setq helm-apropos-fuzzy-match t)
(setq helm-lisp-fuzzy-completion t)

(global-set-key (kbd "C-x C-b")    'helm-buffers-list)
(global-set-key (kbd "M-x")        'helm-M-x)
(global-set-key (kbd "C-c h")      'helm-command-prefix)
(global-set-key (kbd "C-x C-f")    'helm-find-files)
(global-set-key (kbd "M-y")        'helm-show-kill-ring)
(global-set-key (kbd "M-s o")      'helm-occur)
(global-set-key (kbd "C-h SPC")    'helm-all-mark-rings)

(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
